tutorials/fluidSolidInteraction/HronTurekFsi3/ras/constant/fluid/fluidProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fluidProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// fluidModel    icoFluid;
// fluidModel    pisoFluid;
fluidModel    transientSimpleFluid;

"icoFluidCoeffs|pisoFluidCoeffs"
{
    nCorrectors 3;
    nNonOrthogonalCorrectors 1;
}

transientSimpleFluidCoeffs
{
    nOuterCorrectors 10;
    nNonOrthogonalCorrectors 1;
    convergence 1e-6;
}

// ************************************************************************* //
