tutorials/fluidSolidInteraction/HronTurekFsi3/ras/constant/fluid/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// For icoFluid
nu              nu [0 2 -1 0 0 0 0] 1e-6;
rho             rho [1 -3 0 0 0 0 0] 1000;

// For piso/transientSimple
transportModel  Newtonian;

// ************************************************************************* //
